In [1]:
import pandas as pd

# Arithmetic Operator/Operations in Pandas
***

In [2]:
val=pd.DataFrame({"X":[11,15,17,16,18],"Y":[1,3,5,7,9]},index=("i","ii","iii","iv","v"))
val

      X  Y
i    11  1
ii   15  3
iii  17  5
iv   16  7
v    18  9

In [3]:
val["Res"]=val["X"]+val["Y"] # val["Res"] adds new column in val named by "Res".

val

      X  Y  Res
i    11  1   12
ii   15  3   18
iii  17  5   22
iv   16  7   23
v    18  9   27

***As '+' we can perfome all arithmetic operations***
***

# Performing Logical Operation on DataFrame's column

In [4]:
val["X - Truth"]=val["X"]%2==0

val

      X  Y  Res  X - Truth
i    11  1   12      False
ii   15  3   18      False
iii  17  5   22      False
iv   16  7   23       True
v    18  9   27       True

***